{
	"professionalSummary": {
		"sectionTitle": "Professional Summary",
		"content": {
			"name": "Roberto Pantoja",
			"title": "Software Engineer",
			"content": " Experienced Software Engineer with a strong background in full-stack development, machine learning, and system optimization. Proven ability to develop scalable web solutions using React and Flask. Skilled in solving complex technical issues and effectively collaborating with stakeholders to deliver impactful solutions. Currently pursuing a Master’s in Computer Science to advance expertise and stay current with industry trends."
		}
	},
	"workExperience": {
		"sectionTitle": "Work Experience",
		"content":  [
			{
				"company": "IBM",
				"title": "Senior Data Scientist",
				"startDate": "April 2025",
				"endDate": "Present",
				"responsibilities": [
					"Reduced API Memory usage by 70%"
				],
				"skills": ["python"]
			},		
			{
				"company": "IBM",
				"title": "Data Scientist",
				"startDate": "March 2023",
				"endDate": "March 2022",
				"responsibilities": [
					"Reduced API call latency by 10% and batch data processing time by 4+ hours by optimizing backend sytems",
					"Increased true positive rate by 25% and reduced false negative rate by 80% by fine-tuning transformer-based models to for token classification",
					"Built several generative AI POCs using React, Flask, and LangChain"
				],
				"skills": ["python"]
			},
			{
				"company": "IBM",
				"title": "Associate Data Scientist",
				"startDate": "February 2022",
				"endDate": "February 2023",
				"responsibilities": [
					"Developed machine learning models for text classification, significantly improving model performance",
					"Created a robust data preprocessing pipeline, consisting of data transformation, data cleaning, and feature engineering"
				],
				"skills": ["python"]
			},
			{
				"company": "KForce",
				"title": "Programmer Analyst",
				"startDate": "September 2021",
				"endDate": "January 2022",
				"responsibilities": [
					"Supported real-time traders by developing and maintaining high-performance trading platforms, ensuring low-latency and high-throughput operations.",
					"Utilized shell scripting and programming concepts to maintain the proper functioning of real-time trading systems and data pipelines, including monitoring and troubleshooting issues",
					"Upgraded several sites to modern software stacks, incorporating technologies such as Docker and Kubernetes, which increased efficiency, scalability, and resiliency of the trading systems."
				],
				"skills": ["python"]
			}
		]
	},
	"education" : {
		"sectionTitle": "Education",
		"content": [
			{
				"university": "Georgia Institute of Technology",
				"degree": "Master's",
				"major": "Computer Science",
				"startDate": "Jan 2025",
				"endDate": "Present"
			},
			{
				"university": "University of Florida",
				"degree": "Bachelor's",
				"major": "Computer Science",
				"startDate": "August 2017",
				"endDate": "May 2021"
			}
		]
	}
}
